---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlIor
source: html/17b52abc-0f59-4375-de85-9cb4a48a15ca.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlIor Property

The property labeled "Blend" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintPearlIor { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".